#1 Задан некоторый список A содержащий целые числа.
#Pазработать программу, которая вычисляет сумму элементов списка.

nums = [2,3,67,11,65]
print(sum(nums))

#2 Задан список строк.
#В каждой строке подсчитать количество вхождений заданного символа.

word = ['Hello', 'Hi', 'What your name?']
check_number = input("Введите символ: ")
print(''.join(word).count(check_number))


#3 Пользователь вводит число.
#Определение наличия заданного элемента в списке list_=[2,8,3,4,3,5,2,1,0,3,4,4,5,8,7,7,5].
#Если элемент не найден, то выводится соответствующее сообщение.

number = int(input("Введите число: "))
list_numbers = [2, 8, 3, 4, 3, 5, 2, 1,
                0, 3, 4, 4, 5, 8, 7, 7,
                5]

if number in list_numbers:
    print("Данное число находится в главном списке.")
else:
    print("Данного числа нету в главном списке.")
