#1 Задан некоторый список A содержащий целые числа.
#Pазработать программу, которая вычисляет сумму элементов списка.

A = [2,3,67,11,65]
print(sum(A))

#2 Задан список строк.
#В каждой строке подсчитать количество вхождений заданного символа.

B = ["Hello", "Hi", "What your name?"]
enter = input("Введите символ: ")
print(''.join(B).count(enter))


#3 Пользователь вводит число.
#Определение наличия заданного элемента в списке list_=[2,8,3,4,3,5,2,1,0,3,4,4,5,8,7,7,5].
#Если элемент не найден, то выводится соответствующее сообщение.

list_num = int(input("Введите число: "))
list_= [2, 8, 3, 4, 3, 5, 2, 1,
        0, 3, 4, 4, 5, 8, 7, 7,
        5]

if list_num in list_:
    print("Данное число находится в главном списке.")
else:
    print("Данного числа нету в главном списке.")
